examples/rsimulator-example-unittest/src/main/resources/com/github/bjuvensjo/rsimulator/example/unittest/transfer/Transfer.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/transfer/"
                  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  name="Transfer" targetNamespace="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/transfer/">
    <wsdl:types>
        <xsd:schema
                targetNamespace="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/transfer/">
            <xsd:include schemaLocation="./Transfer.xsd"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="TransferRequest">
        <wsdl:part element="tns:TransferRequest" name="parameters"/>
    </wsdl:message>
    <wsdl:message name="TransferResponse">
        <wsdl:part element="tns:TransferResponse" name="parameters"/>
    </wsdl:message>
    <wsdl:portType name="TransferPort">
        <wsdl:operation name="Transfer">
            <wsdl:input message="tns:TransferRequest"/>
            <wsdl:output message="tns:TransferResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="TransferSOAP" type="tns:TransferPort">
        <soap:binding style="document"
                      transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="Transfer">
            <soap:operation
                    soapAction="http://www.github.com/bjuvensjo/rsimulator/example/unittest/transfer/transfer/Pay"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="TransferService">
        <wsdl:port binding="tns:TransferSOAP" name="TransferSOAP">
            <soap:address location="http://localhost:8080/"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
